package com.example.Algorithm;

public class NexonTest_02 {

//	180도 시간 계산 문제.
//	12시 30분이라는 곡의 가사에서 보면 12시 30분에 시침과 분침이 등을 지고 있는 것으로 묘사됩니다. 
//	하지만 실제로 12시 30분에는 시침과 분침이 180도 각을 이루고 있지는 않습니다. --> 왜?
//	각 시간을 입력 받아 해당 ‘시’에 시침과 분침이 180도 각을 이루는 정확한 ‘시, 분, 초’를 구하는 함수를 작성하시기 바랍니다.
//
//	함수 입력값: 시 (1 ~ 12 사이의 숫자)
//	함수 출력값: 입력 받은 시에서 시침과 분침이 180도를 이루는 정확한 ‘시, 분, 초’ 문자열
//
//	예제
//	Input
//	12
//	6
//	Output
//	12h 32m 43.64s
//	6h 0m 0s
	public static void angle(int x, int y) {
		// 1시간이 지나면 360도가 움직임
		// 1시간은 60분
		// 1분에 6도 움직임
		final int minute = 6;
		// 12시에서 12시 6분으로 이동한 각도 : 36도
		
		
	} 
	
	public static void main(String[] args) {
		
	}
}
